Revit 2027 API
View.IsViewValidForTemplateCreation Method
 Verifies that the view is valid for template creation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsViewValidForTemplateCreation()
Public Function IsViewValidForTemplateCreation As Boolean
public:
bool IsViewValidForTemplateCreation()
member IsViewValidForTemplateCreation : unit -> bool
Return Value
Boolean
 True if the view can be used for view template creation, false otherwise.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace